Тест_ЗУП_31_КОРП/src/Enums/ВидыСобытийАдаптацииУвольнения/ВидыСобытийАдаптацииУвольнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытийАдаптацииУвольнения</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеВДолжности</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ВидыМероприятийАдаптацииУвольнения/ВидыМероприятийАдаптацииУвольнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятийАдаптацииУвольнения</name>
  <enumValues>
    <name>Адаптация</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ВидыСобытийАдаптацииУвольнения/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	АдаптацияУвольнениеВызовСервера.ОбработкаПолученияДанныхВыбораПеречисленияВидыСобытийАдаптацииУвольнения(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеВидыСобытий(ВидМероприятия = НеОпределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидМероприятия) Тогда
		ВидыСобытий = СобытияАдаптации();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыСобытий, СобытияУвольнения(), Истина);
	ИначеЕсли ВидМероприятия = Перечисления.ВидыМероприятийАдаптацииУвольнения.Адаптация Тогда
		ВидыСобытий = СобытияАдаптации();
	Иначе
		ВидыСобытий = СобытияУвольнения();
	КонецЕсли;
	
	Возврат ВидыСобытий;
	
КонецФункции

Функция СобытияАдаптации() Экспорт
	
	ВидыСобытий = Новый Массив;
	ВидыСобытий.Добавить(ВозвратИзОтпускаПоУходуЗаРебенком);
	ВидыСобытий.Добавить(ВосстановлениеВДолжности);
	ВидыСобытий.Добавить(Прием);
	ВидыСобытий.Добавить(Перемещение);
	
	Возврат ВидыСобытий;
	
КонецФункции

Функция СобытияУвольнения() Экспорт
	
	ВидыСобытий = Новый Массив;
	ВидыСобытий.Добавить(Перемещение);
	ВидыСобытий.Добавить(ОтпускПоУходуЗаРебенком);
	ВидыСобытий.Добавить(Увольнение);
	
	Возврат ВидыСобытий;
	
КонецФункции

#КонецОбласти

#КонецЕсли
